var current_time = new Date()

var auction = {
  current_stage: -100,
  stages: [
   {
       "start": "2015-01-27T18:30:00+02:00",
       "type": "pause"
   },
   {
       "bidder_id": "a5d50c7333084d1ab59bd95833c437e8",
       "changed": true,
       "label": {
           "ru": "Учасник 1",
           "en": "Учасник 1",
           "uk": "Учасник 1"
       },
       "start": "2015-01-27T18:35:00+02:00",
       "amount": 495000,
       "time": "2015-01-27T18:35:35.297543+02:00",
       "type": "bids"
   },
   {
       "bidder_id": "9dba99c7ca0a4af085a47fe2a728e3b6",
       "label": {
           "ru": "Учасник 2",
           "en": "Учасник 2",
           "uk": "Учасник 2"
       },
       "start": "2015-01-27T18:37:00+02:00",
       "amount": 450000,
       "time": "2015-01-27T18:16:53.647231+02:00",
       "type": "bids"
   },
   {
       "start": "2015-01-27T18:39:00+02:00",
       "type": "pause"
   },
   {
       "bidder_id": "a5d50c7333084d1ab59bd95833c437e8",
       "changed": true,
       "label": {
           "ru": "Учасник 1",
           "en": "Учасник 1",
           "uk": "Учасник 1"
       },
       "start": "2015-01-27T18:41:00+02:00",
       "amount": 480000,
       "time": "2015-01-27T18:41:59.059808+02:00",
       "type": "bids"
   },
   {
       "bidder_id": "9dba99c7ca0a4af085a47fe2a728e3b6",
       "label": {
           "ru": "Учасник 2",
           "en": "Учасник 2",
           "uk": "Учасник 2"
       },
       "start": "2015-01-27T18:43:00+02:00",
       "amount": 450000,
       "time": "2015-01-27T18:16:53.647231+02:00",
       "type": "bids"
   },
   {
       "start": "2015-01-27T18:45:00+02:00",
       "type": "pause"
   },
   {
       "bidder_id": "a5d50c7333084d1ab59bd95833c437e8",
       "label": {
           "ru": "Учасник 1",
           "en": "Учасник 1",
           "uk": "Учасник 1"
       },
       "start": "2015-01-27T18:47:00+02:00",
       "amount": 480000,
       "time": "2015-01-27T18:41:59.059808+02:00",
       "type": "bids"
   },
   {
       "bidder_id": "9dba99c7ca0a4af085a47fe2a728e3b6",
       "label": {
           "ru": "Учасник 2",
           "en": "Учасник 2",
           "uk": "Учасник 2"
       },
       "start": "2015-01-27T18:49:00+02:00",
       "amount": 450000,
       "time": "2015-01-27T18:16:53.647231+02:00",
       "type": "bids"
   },
   {
       "start": "2015-01-27T18:51:00+02:00",
       "type": "announcement"
   }
]
};

var auctionNew = {"_id":"99f03f43a68c44b78d69bc0096169b27_c407631f245e40fda33fbe4080da06f6","_rev":"13-87936b0577504db2e5e31bb81a31e1f0","value":{"currency":"UAH","amount":26230073325.419998169,"valueAddedTaxIncluded":true},"initial_bids":[{"amount":1214705029.4200000763,"bidder_id":"c026dc32cd754a0ea6ca8a93146d1ad8","time":"2016-10-29T10:53:50.330510+03:00","label":{"ru":"Київський професійний будівельний ліцей","en":"Київський професійний будівельний ліцей","uk":"Київський професійний будівельний ліцей"}},{"amount":18002193964.459999084,"bidder_id":"185a3f8de13b420e9b4287c3e797acb8","time":"2016-10-29T10:53:28.364443+03:00","label":{"ru":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","en":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","uk":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\""}}],"endDate":"2016-10-29T11:59:39+03:00","description":"Обгравати покоржавіти надовбати доборотися поновини перегортувати утинок сокирник оленя дідизний.","title":"[ТЕСТУВАННЯ] Варт гарбариха.","minimalStep":{"currency":"UAH","amount":219989399.09999999404,"valueAddedTaxIncluded":true},"items":[{"relatedLot":"c407631f245e40fda33fbe4080da06f6","description":"i-24fdf5ab: Вироби канцелярські, паперові","classification":{"scheme":"CPV","description":"Газетний папір, папір ручного виготовлення та інший некрейдований папір або картон для графічних цілей","id":"22990000-6"},"description_en":"i-53da976a: Paper stationery","additionalClassifications":[{"scheme":"ДКПП","id":"58.19.19-00.00","description":"Продукція друкована, інша"}],"deliveryLocation":{"latitude":48.465355999999999881,"longitude":35.045667000000001678},"deliveryAddress":{"locality":"Дніпропетровськ","region":"Дніпропетровська область","countryName_en":"Ukraine","countryName":"Україна","streetAddress":"проспект Карла Маркса, 52","countryName_ru":"Украина","postalCode":"50064"},"deliveryDate":{"startDate":"2016-10-30T10:31:49.280667+03:00","endDate":"2016-10-30T10:31:49.280700+03:00"},"description_ru":"i-c4fb6bd3: Изделия канцелярские, бумажные","id":"8dc93e8496464bab9a0c5a9d541f663d","unit":{"code":"H87","name":"штуки"},"quantity":114}],"title_en":"[TESTING] Networked heuristic methodology","results":[{"amount":18002193964.459999084,"bidder_id":"185a3f8de13b420e9b4287c3e797acb8","time":"2016-10-29T10:53:28.364443+03:00","label":{"ru":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","en":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","uk":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\""}},{"amount":1214705029.4200000763,"bidder_id":"c026dc32cd754a0ea6ca8a93146d1ad8","time":"2016-10-29T10:53:50.330510+03:00","label":{"ru":"Київський професійний будівельний ліцей","en":"Київський професійний будівельний ліцей","uk":"Київський професійний будівельний ліцей"}}],"auction_type":"default","title_ru":"[ТЕСТИРОВАНИЕ] User-centric content-based toolset","description_ru":"Квюоджёныглэгэнтур мэльёуз лэгыры мацим номинатй прё рэгяонэ апыирёан рыпрэхэндунт ед ведят пэркйпет жэмпэр нык.","procuringEntity":{"contactPoint":{"url":"http://kpt.kiev.ua/","faxNumber":"0442546580","email":"kpt-t@ukr.net","name":"ГУЛАЙ ОЛЕКСАНДР ВІКТОРОВИЧ","telephone":"0999826173"},"identifier":{"scheme":"UA-EDR","id":"31725604","legalName":"КОМУНАЛЬНЕ ПІДПРИЄМСТВО \"КИЇВПАСТРАНС\""},"name":"КОМУНАЛЬНЕ ПІДПРИЄМСТВО \"КИЇВПАСТРАНС\"","kind":"other","address":{"postalCode":"04070","countryName":"Україна","streetAddress":"Набережне шосе, 2","region":"місто Київ","locality":"Київ"}},"lot":{"title_en":"l-e13e7bb0: Et at aut ut voluptas.","description":"Замішанина підсмалити подружка потесати висповідатися замішанина чепурніти.","title_ru":"l-a408ddfd: Вэртырэм рыпрэхэндунт пауло нюлльам видишчы.","title":"l-669f25da: Насупереки штучний люб'ячий."},"current_stage":10,"TENDERS_API_VERSION":"2.3","stages":[{"start":"2016-10-29T11:38:39+03:00","type":"pause","stage":"pause"},{"bidder_id":"185a3f8de13b420e9b4287c3e797acb8","label":{"ru":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","en":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","uk":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\""},"start":"2016-10-29T11:43:39+03:00","amount":18002193964.459999084,"time":"2016-10-29T10:53:28.364443+03:00","type":"bids"},{"bidder_id":"c026dc32cd754a0ea6ca8a93146d1ad8","label":{"ru":"Київський професійний будівельний ліцей","en":"Київський професійний будівельний ліцей","uk":"Київський професійний будівельний ліцей"},"start":"2016-10-29T11:45:39+03:00","amount":1214705029.4200000763,"time":"2016-10-29T10:53:50.330510+03:00","type":"bids"},{"start":"2016-10-29T11:47:39+03:00","type":"pause","stage":"pause"},{"bidder_id":"185a3f8de13b420e9b4287c3e797acb8","label":{"ru":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","en":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","uk":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\""},"start":"2016-10-29T11:49:39+03:00","amount":18002193964.459999084,"time":"2016-10-29T10:53:28.364443+03:00","type":"bids"},{"bidder_id":"c026dc32cd754a0ea6ca8a93146d1ad8","label":{"ru":"Київський професійний будівельний ліцей","en":"Київський професійний будівельний ліцей","uk":"Київський професійний будівельний ліцей"},"start":"2016-10-29T11:51:39+03:00","amount":1214705029.4200000763,"time":"2016-10-29T10:53:50.330510+03:00","type":"bids"},{"start":"2016-10-29T11:53:39+03:00","type":"pause","stage":"pause"},{"bidder_id":"185a3f8de13b420e9b4287c3e797acb8","label":{"ru":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","en":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\"","uk":"Філія \"Дельта-лоцман\" державного підприємства \"Адміністрація морських портів України\""},"start":"2016-10-29T11:55:39+03:00","amount":18002193964.459999084,"time":"2016-10-29T10:53:28.364443+03:00","type":"bids"},{"bidder_id":"c026dc32cd754a0ea6ca8a93146d1ad8","label":{"ru":"Київський професійний будівельний ліцей","en":"Київський професійний будівельний ліцей","uk":"Київський професійний будівельний ліцей"},"start":"2016-10-29T11:57:39+03:00","amount":1214705029.4200000763,"time":"2016-10-29T10:53:50.330510+03:00","type":"bids"},{"start":"2016-10-29T11:59:39+03:00","type":"pre_announcement"},{"start":"","type":"announcement"}],"description_en":"Sed eos rerum et officiis ullam sed fuga officia recusandae quia ea.","tenderID":"UA-2016-10-29-000009-1"};

var bidder_id = 'id_1',
  Rounds = [0, 3, 9];